{
  "OmniGenomefold_config": null,
  "_name_or_path": "benchmark/genomic_foundation_models/OmniGenomeV3-186M",
  "architectures": [
    "OmniGenomeModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_omnigenome.OmniGenomeConfig",
    "AutoModel": "modeling_omnigenome.OmniGenomeModel",
    "AutoModelForMaskedLM": "anonymous8/OmniGenome-186M--modeling_omnigenome.OmniGenomeForMaskedLM",
    "AutoModelForSeq2SeqLM": "anonymous8/OmniGenome-186M--modeling_omnigenome.OmniGenomeForSeq2SeqLM",
    "AutoModelForTokenClassification": "anonymous8/OmniGenome-186M--modeling_omnigenome.OmniGenomeForTokenClassification"
  },
  "classifier_dropout": null,
  "emb_layer_norm_before": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0,
  "hidden_size": 720,
  "id2label": {
    "0": "(",
    "1": ")",
    "2": "."
  },
  "initializer_range": 0.02,
  "intermediate_size": 2560,
  "is_folding_model": false,
  "label2id": {
    "(": 0,
    ")": 1,
    ".": 2
  },
  "layer_norm_eps": 1e-05,
  "mask_token_id": 23,
  "max_position_embeddings": 1026,
  "model_type": "mprna",
  "num_attention_heads": 30,
  "num_generation": 50,
  "num_hidden_layers": 32,
  "num_population": 100,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "token_dropout": true,
  "torch_dtype": "float16",
  "transformers_version": "4.42.0.dev0",
  "use_cache": true,
  "vocab_list": null,
  "vocab_size": 24
}
